리스트 = []
리스트 = [
        1,
        2,
        3
]

딕셔너리 = {
    "키A" : "값A",
    "키B" : "값B",
    "키C" : "값C"
}

# 딕셔너리["키A"] # 키 --- 값A출력
# 딕셔너리["키B"] # 키 --- 값B출력
# 딕셔너리["키C"] # 키 --- 값C출력


print(딕셔너리["키A"])
print(딕셔너리["키B"])
print(딕셔너리["키C"])

딕셔너리 = {
    "문자열" : "값",
    273 : [1,2,3,4],
    True : False
}

print(딕셔너리["문자열A"])
print(딕셔너리[273])
print(딕셔너리[True])

#===============================================================

for key in 딕셔너리 : 
    print("{} : {} ".format(key, 딕셔너리[key]))

딕셔너리["키"] = "값"
print()
for key in 딕셔너리 :
    print("{} : {}".format(key, 딕셔너리[key]))


del 딕셔너리["키"]
print()
for key in 딕셔너리 : 
    print("{} : {}".format(key, 딕셔너리[key]))

